In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
data = pd.read_csv("C:\\Users\\jitender\\Downloads\\0000000000002429_training_titanic_x_y_train.csv")

In [3]:
def fill_na(cols):
    Age = cols[0]
    Pclass = cols[1]
    if pd.isnull(Age):
        if Pclass==1:
            return 37
        elif Pclass==2:
            return 29
        else:
            return 24
    else:
        return Age

In [4]:
data['Age'] = data[['Age','Pclass']].apply(fill_na,axis=1)

In [5]:
data.drop('Cabin',axis=1,inplace=True)

In [6]:
data.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,24.0,0,0,A/5 2466,8.050,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,S,0

In [7]:
sex  = pd.get_dummies(data['Sex'],drop_first=True)

In [8]:
embark  = pd.get_dummies(data['Embarked'],drop_first=True)

In [9]:
train = pd.concat([data,sex,embark],axis=1)

In [10]:
train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived,male,Q,S
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,S,1,0,0,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,24.0,0,0,A/5 2466,8.050,S,0,1,0,1
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,S,0,1,0,1
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,S,0,0,0,1
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,S,0,1,0,1

In [11]:
train.drop(['Sex','Name','Embarked','Ticket'],axis=1,inplace=True)

In [12]:
x = train.drop('Survived',axis=1)
y = train['Survived']

In [13]:
from sklearn.linear_model import LogisticRegression
from sklearn.preprocessing import StandardScaler
from sklearn.ensemble import RandomForestRegressor
from sklearn.svm import SVC

C:\Users\jitender\Anaconda3\lib\site-packages\sklearn\ensemble\weight_boosting.py:29: DeprecationWarning: numpy.core.umath_tests is an internal NumPy module and should not be imported. It will be removed in a future NumPy release.
  from numpy.core.umath_tests import inner1d

In [14]:
scaler = StandardScaler()
scaler.fit(x)
scaled_x = scaler.transform(x)

In [15]:
mac = SVC(C=0.7)

In [16]:
mac.fit(scaled_x,y)

SVC(C=0.7, cache_size=200, class_weight=None, coef0=0.0,
  decision_function_shape='ovr', degree=3, gamma='auto', kernel='rbf',
  max_iter=-1, probability=False, random_state=None, shrinking=True,
  tol=0.001, verbose=False)

In [17]:
test = pd.read_csv("C:\\Users\\jitender\\Downloads\\0000000000002429_test_titanic_x_test.csv")

In [18]:
test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [19]:
test['Age'] = test[['Age','Pclass']].apply(fill_na,axis=1)

In [20]:
test.drop('Cabin',axis=1,inplace=True)

In [21]:
sex1 = pd.get_dummies(test['Sex'],drop_first=True)

In [22]:
embark1 = pd.get_dummies(test['Embarked'],drop_first=True)

In [23]:
test.drop(['Name','Sex','Ticket','Embarked'],axis=1,inplace=True)

In [24]:
test = pd.concat([test,sex1,embark1],axis=1)

In [25]:
test = test.dropna()

In [26]:
scaled_test = scaler.transform(test)

In [27]:
ypred = mac.predict(scaled_test)

In [28]:
for i in range(ypred.shape[0]):
    if ypred[i]<0.5:
        ypred[i] = 0
    else:
        ypred[i]=1

In [29]:
np.savetxt('titanic_result.csv',ypred)

In [ ]:
mac.score(test,)